app/controllers/posts_controller.rb

SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "posts".* FROM "posts"
---
  def index
    @authors = Author.all

    if !params[:author].blank?
      @posts = Post.where(author: params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
        @posts = Post.where("created_at >= ?", Time.zone.today.beginning_of_day)
      else
        @posts = Post.where("created_at < ?"), Time.zone.today.beginning_of_day)
      end
    else
      @posts = Post.all